{
  "title": {
    "locales": {
      "en": {
        "title_short": "Life recently",
        "title_short_nav": "Publications & Updates",
        "title_long_prefix": "Take a look at my",
        "title_long": "Recent {{Updates}}"
      }
    }
  },

  "articles": [
    {
      "id": 1,
      "component": "ArticleFacts",
      "locales": {},
      "settings": {
        "order_items_by": "id",
        "order_items_sort": "asc"
      },
      "items": [
        {
          "id": 1,
          "img": null,
          "faIcon": "fa-solid fa-star",
          "faIconColors": { "bg": "", "fill": "" },
          "locales": {
            "en": {
              "title": "19",
              "text": "Stars on GitHub"
            }
          }
        },
        {
          "id": 2,
          "img": null,
          "faIcon": "fa-solid fa-globe",
          "faIconColors": { "bg": "", "fill": "" },
          "locales": {
            "en": {
              "title": "0",
              "text": "Countries visited"
            }
          }
        },

        {
          "id": 3,
          "img": null,
          "faIcon": "fa-solid fa-coffee",
          "faIconColors": { "bg": "", "fill": "" },
          "locales": {
            "en": {
              "title": "5,000+",
              "text": "Coffees consumed"
            }
          }
        },
        {
          "id": 4,
          "img": null,
          "faIcon": "fa-solid fa-laptop-code",
          "faIconColors": { "bg": "", "fill": "" },
          "locales": {
            "en": {
              "title": "100,000+",
              "text": "Lines of code"
            }
          }
        },
        {
          "id": 5,
          "img": null,
          "faIcon": "fa-solid fa-heart",
          "faIconColors": { "bg": "", "fill": "" },
          "locales": {
            "en": {
              "title": "Infinite",
              "text": "Passion for learning"
            }
          }
        }
      ]
    },

    {
      "id": 2,
      "component": "ArticleThread",
      "locales": {
        "en": { "title": "Research {{Publication}}" }
      },
      "settings": {
        "max_rows_collapse_threshold": 3,
        "order_items_by": "dateStart",
        "order_items_sort": "desc"
      },
      "items": [
        {
          "id": 1,
          "date": { "year": 2025, "month": 5 },
          "locales": {
            "en": {
              "title": "Comparative Analysis of CNN Architectures for Eye Disease Diagnosis Using Retinal Images",
              "province": "Accepted",
              "country": "CONFERENCE (MECON-2025)",
              "institution": "",
              "text": "Detecting eye diseases is crucial in medical diagnostics, particularly for preventing vision loss or blindness through timely intervention. This study aims to find the most effective DL model for the automated classification of common eye conditions from retinal fundus images. Specifically, we evaluate five advanced Convolutional Neural Network (CNN) architectures DenseNet201, MobileNetV2, NASNetMobile, ResNet50V2, and Xception, for classifying six eye diseases (Diabetic Retinopathy, Disc Oedema, Macular Degeneration, Myopia, Retinal Detachment, and Retinitis Pigmentosa) along with healthy cases. A total of 4,200 labeled fundus images were used, and transfer learning with fine-tuning was performed to optimize each model. The review process involved measuring classification accuracy, precision, recall, and F1-score. DenseNet201 got the best performance, with the highest test accuracy of 98.0% and superior metrics across all disease classes. While ResNet50V2 and Xception also showed strong performance, MobileNetV2 and NASNetMobile offered competitive results with lower computational cost, making them suitable for deployment in resource-constrained environments. This study shows the potential of CNNs to support clinical decision-making in ophthalmology and highlights directions for future work in model interpretability and generalizability using ensemble techniques and larger datasets."
            }
          }
        },
        {
          "id": 2,
          "date": { "year": 2023, "month": 6 },
          "locales": {
            "en": {
              "title": "A Novel CWT-CNN Framework for Driver Fatigue Detection from EEG Signals",
              "province": "Accepted",
              "country": "CONFERENCE (MECON-2025)",
              "institution": "",
              "text": "Fatigued driving has been a significant contributor to traffic accidents globally posing serious threats to both human life and economic stability. Machine learning techniques based on electroencephalography (EEG) are showing promise for detecting driver fatigue, excelling other physiological modalities in this regard. However, it takes a lot of exertion, requires domain knowledge, and might not generalise effectively across different datasets to manually extract features from EEG signals. Therefore, investigating innovative deeplearning architectures that can effectively extract discriminative characteristics from unprocessed EEG data is necessary. This paper proposes a novel framework for driver fatigue detection from EEG signals using Continuous Wavelet Transform (CWT) and Convolutional Neural Networks (CNN). Rather than depending on hand-crafted feature extraction, we use CWT to convert EEG data into time-frequency spectrum pictures. After concatenating these spectral images from every channel, a CNN is fed to learn discriminative features for driver normal and fatigued states automatically. An average classification accuracy of 98.3% is obtained by evaluating the proposed CWTCNN system on a publicly available EEG dataset comprising recordings from twelve subjects. The results obtained indicate that the CWT-CNN framework has enormous potential to create strong driver fatigue detection systems, thereby enhancing road safety."
            }
          }
        },
        {
          "id": 3,
          "date": { "year": 2024, "month": 12 },
          "locales": {
            "en": {
              "title": "Hybrid Deep Learning Approach for Accurate Grape Leaf Disease Segmentation and Classification",
              "province": "Accepted",
              "country": "CONFERENCE (QPAIN-2025)",
              "institution": "",
              "text": "A grape, a luscious drupe, belongs to the (Vitis genus) of flowering flora. Historians posit that its genesis traces back to the Middle East, where cultivation commenced nearly 6,000–8,000 years ago. Grape pathologies are inevitable due to fluctuating climatic and ecological paradigms, with bacterial, viral, and fungal pathogens instigating early foliar afflictions. Employing deep learning (DL) and segmentation is imperative to curbing disease proliferation and fortifying viticultural resilience. Segmentation is as a linchpin in diagnosing and delineating pathological zones from verdant foliage. To amplify classification precision, DL paradigms integrate Convolutional Neural Networks (CNNs) with Recurrent Neural Networks (RNNs), specifically Gated Recurrent Units (GRU), BiDirectional Long Short-Term Memory (BiLSTM), and Long Short-Term Memory (LSTM) layers. By exploiting pre-trained CNN architectures such as DenseNet201, Xception, and InceptionV3 for spatial feature extrapolation and amalgamating them with RNN layers to discern sequential interdependencies, the model adeptly internalizes nuanced disease evolution. BiLSTM synergized with DenseNet201 exhibits a superlative accuracy of 99.83%, rendering it computationally frugal yet robust. Conventional viticulturists often grapple with precise disease discernment, incurring substantial fiscal detriments. This study accentuates imagecentric methodologies for grape leaf disease diagnostics, catalyzing avant-garde AI-driven interventions in precision agriculture"
            }
          }
        },
        {
          "id": 4,
          "date": { "year": 2025, "month": 3 },
          "locales": {
            "en": {
              "title": "Optimization of Power Plant Performance Using Multi-Feature Data Analysis for Energy Dispatch and Load Management",
              "province": "Under Review",
              "country": "JOURNAL",
              "institution": "Updaing....."
            }
          }
        },
        {
          "id": 5,
          "date": { "year": 2025, "month": 6 },
          "locales": {
            "en": {
              "title": "Deep Learning for Scientific Image Classification: A Comparative Analysis of CNN,ConvNeXt, EfficientNet, and Vision Transformers",
              "province": "Under Review",
              "country": "JOURNAL",
              "institution": "",
              "text": "Updaing....."
            }
          }
        }
      ]
    }
  ]
}
